## Terraform Plan Output

**Summary:** `Plan: 4 to add, 1 to change, 0 to destroy.`

- 🟢 **Create**: 4
- 🟡 **Update**: 1
- 🔴 **Destroy**: 0

<details><summary>Click to expand full plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.github_oidc will be updated in-place
  ~ resource "azuread_application" "github_oidc" {
        id                             = "/applications/ede051fb-f928-44d9-ba3a-d4de9beeda8e"
      ~ owners                         = [
          - "78b776c8-c1c5-4f5b-b46e-4dcd278720b5",
          + "c089d8e7-1149-4e35-afa2-82d01a3ae4e2",
        ]
        tags                           = []
        # (25 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # azuread_application_federated_identity_credential.branches["edgeops-keyvault-module"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = "/applications/ede051fb-f928-44d9-ba3a-d4de9beeda8e"
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for branch main"
      + display_name          = "github-EdgeOpsTech.edgeops-keyvault-module-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-keyvault-module-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = "/applications/ede051fb-f928-44d9-ba3a-d4de9beeda8e"
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for environment dev"
      + display_name          = "github-EdgeOpsTech.edgeops-keyvault-module-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:environment:dev"
    }

  # azuread_application_federated_identity_credential.pull_request["edgeops-keyvault-module"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = "/applications/ede051fb-f928-44d9-ba3a-d4de9beeda8e"
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for pull_request"
      + display_name          = "github-EdgeOpsTech.edgeops-keyvault-module-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:pull_request"
    }

  # azurerm_storage_container.tfstate["edgeops-keyvault-module"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "edgeops-keyvault-module"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ backend_config      = <<-EOT
        resource_group_name  = "rg-tfstate"
        storage_account_name = "edgeopstechtfstate"
        container_name       = "terraform-azure-ops"
        # key                  = "terraform-terraform-azure-ops.tfstate"
        key                  = "terraform.tfstate"
        
        use_oidc  = true
        client_id = "fb40e7aa-7931-4675-9295-b0d7620ebf9a"
        
        
        resource_group_name  = "rg-tfstate"
        storage_account_name = "edgeopstechtfstate"
        container_name       = "kv-rbac-setup"
        # key                  = "terraform-kv-rbac-setup.tfstate"
        key                  = "terraform.tfstate"
        
        use_oidc  = true
        client_id = "fb40e7aa-7931-4675-9295-b0d7620ebf9a"
        
        
        resource_group_name  = "rg-tfstate"
        storage_account_name = "edgeopstechtfstate"
        container_name       = "super-webapp"
        # key                  = "terraform-super-webapp.tfstate"
        key                  = "terraform.tfstate"
        
        use_oidc  = true
        client_id = "fb40e7aa-7931-4675-9295-b0d7620ebf9a"
        
        
        resource_group_name  = "rg-tfstate"
        storage_account_name = "edgeopstechtfstate"
        container_name       = "azure-vm-setup"
        # key                  = "terraform-azure-vm-setup.tfstate"
        key                  = "terraform.tfstate"
        
        use_oidc  = true
        client_id = "fb40e7aa-7931-4675-9295-b0d7620ebf9a"
        
        
        resource_group_name  = "rg-tfstate"
        storage_account_name = "edgeopstechtfstate"
        container_name       = "edgeops-sub-mgmt"
        # key                  = "terraform-edgeops-sub-mgmt.tfstate"
        key                  = "terraform.tfstate"
        
        use_oidc  = true
        client_id = "fb40e7aa-7931-4675-9295-b0d7620ebf9a"
      + 
      + 
      + resource_group_name  = "rg-tfstate"
      + storage_account_name = "edgeopstechtfstate"
      + container_name       = "edgeops-keyvault-module"
      + # key                  = "terraform-edgeops-keyvault-module.tfstate"
      + key                  = "terraform.tfstate"
      + 
      + use_oidc  = true
      + client_id = "fb40e7aa-7931-4675-9295-b0d7620ebf9a"
    EOT
```
</details>